# Brewfile
# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "d12frosted/emacs-plus"

# Fomulaes
brew "node"
brew "cmake"
brew "python"
brew "go"
brew "java"
brew "maven"
brew "nvim", args: ["HEAD"]
brew "mas"
brew "fzf"
brew "git"
brew "ripgrep"
brew "fd"
brew "coreutils"
brew "emacs-plus@28", args: ["with-elrumo2-icon", "with-no-titlebar", "with-native-comp"]
brew "shellcheck"
brew "glslang"

# Casks
cask "iterm2"
cask "jetbrains-toolbox"

# Mac app store apps
mas "Telegram", id: 747648890
mas "Spark", id: 1176895641
mas "XCode", id: 497799835
mas "Bear", id: 1091189122
mas "Twitter", id: 1482454543
