# Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Fomulaes
brew "node"
brew "cmake"
brew "python"
brew "go"
brew "java"
brew "maven"
brew "nvim"
brew "mas"
brew "fzf"
brew "rg"
brew "fd"

# Casks
cask "iterm2"
cask "jetbrains-toolbox"
cask "visual-studio-code"

# Mac app store apps
mas "Telegram", id: 747648890
mas "Spark", id: 1176895641
mas "XCode", id: 497799835
mas "Bear", id: 1091189122
mas "Twitter", id: 1482454543
