brew "git"
brew "uv"
brew "wget"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "discord"
cask "docker-desktop"
cask "google-chrome"
cask "mac-mouse-fix"
cask "visual-studio-code"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
